xwos/XWOS/xwbd/stm32f42xdkp/bm/stm32cube/xwds/soc.c
#if defined(XWMDCFG_ds_SOC_DMA) && (1 == XWMDCFG_ds_SOC_DMA)
        .dma_req = stm32cube_soc_drv_dma_req,
        .dma_rls = stm32cube_soc_drv_dma_rls,
        .dma_cfg = stm32cube_soc_drv_dma_cfg,
        .dma_enable = stm32cube_soc_drv_dma_enable,
        .dma_disable = stm32cube_soc_drv_dma_disable,
        .dma_start = NULL,
        .dma_stop = NULL,
#endif /* XWMDCFG_ds_SOC_DMA */

#if defined(XWMDCFG_ds_SOC_ERAM) && (1 == XWMDCFG_ds_SOC_ERAM)
        .eram_tst = stm32cube_soc_drv_eram_tst,
#endif /* XWMDCFG_ds_SOC_ERAM */

        .ioctl = NULL,
};

struct stm32cube_soc_cfg {
        struct {
                GPIO_TypeDef * const register_map[11];
        } gpio;
        struct {
                xwu32_t exti_port_map[11];
                xwu32_t exti_line_map[16];
        } eirq;
        struct {
                DMA_TypeDef * ch2dma_map[16];
                xwu32_t ch2stream_map[16];
        } dma;
};

struct stm32cube_soc_cfg stm32cube_soc_cfg = {
        .gpio = {
                .register_map = {
                        [SODS_GPIO_PORT_A] = (GPIO_TypeDef *)GPIOA_BASE,
                        [SODS_GPIO_PORT_B] = (GPIO_TypeDef *)GPIOB_BASE,
                        [SODS_GPIO_PORT_C] = (GPIO_TypeDef *)GPIOC_BASE,
                        [SODS_GPIO_PORT_D] = (GPIO_TypeDef *)GPIOD_BASE,
                        [SODS_GPIO_PORT_E] = (GPIO_TypeDef *)GPIOE_BASE,
                        [SODS_GPIO_PORT_F] = (GPIO_TypeDef *)GPIOF_BASE,
                        [SODS_GPIO_PORT_G] = (GPIO_TypeDef *)GPIOG_BASE,
                        [SODS_GPIO_PORT_H] = (GPIO_TypeDef *)GPIOH_BASE,
                        [SODS_GPIO_PORT_I] = (GPIO_TypeDef *)GPIOI_BASE,
                        [SODS_GPIO_PORT_J] = (GPIO_TypeDef *)GPIOJ_BASE,
                        [SODS_GPIO_PORT_K] = (GPIO_TypeDef *)GPIOK_BASE,
                },
        },
        .eirq = {
                .exti_port_map = {
                        [SODS_GPIO_PORT_A] = LL_SYSCFG_EXTI_PORTA,
                        [SODS_GPIO_PORT_B] = LL_SYSCFG_EXTI_PORTB,
                        [SODS_GPIO_PORT_C] = LL_SYSCFG_EXTI_PORTC,
                        [SODS_GPIO_PORT_D] = LL_SYSCFG_EXTI_PORTD,
                        [SODS_GPIO_PORT_E] = LL_SYSCFG_EXTI_PORTE,
                        [SODS_GPIO_PORT_F] = LL_SYSCFG_EXTI_PORTF,
                        [SODS_GPIO_PORT_G] = LL_SYSCFG_EXTI_PORTG,
                        [SODS_GPIO_PORT_H] = LL_SYSCFG_EXTI_PORTH,
                        [SODS_GPIO_PORT_I] = LL_SYSCFG_EXTI_PORTI,
                        [SODS_GPIO_PORT_J] = LL_SYSCFG_EXTI_PORTJ,
                        [SODS_GPIO_PORT_K] = LL_SYSCFG_EXTI_PORTK,
                },
                .exti_line_map = {
                        [SODS_EIRQ(0)] = LL_SYSCFG_EXTI_LINE0,
                        [SODS_EIRQ(1)] = LL_SYSCFG_EXTI_LINE1,
                        [SODS_EIRQ(2)] = LL_SYSCFG_EXTI_LINE2,
                        [SODS_EIRQ(3)] = LL_SYSCFG_EXTI_LINE3,
                        [SODS_EIRQ(4)] = LL_SYSCFG_EXTI_LINE4,
                        [SODS_EIRQ(5)] = LL_SYSCFG_EXTI_LINE5,
                        [SODS_EIRQ(6)] = LL_SYSCFG_EXTI_LINE6,
                        [SODS_EIRQ(7)] = LL_SYSCFG_EXTI_LINE7,
                        [SODS_EIRQ(8)] = LL_SYSCFG_EXTI_LINE8,
                        [SODS_EIRQ(9)] = LL_SYSCFG_EXTI_LINE9,
                        [SODS_EIRQ(10)] = LL_SYSCFG_EXTI_LINE10,
                        [SODS_EIRQ(11)] = LL_SYSCFG_EXTI_LINE11,
                        [SODS_EIRQ(12)] = LL_SYSCFG_EXTI_LINE12,
                        [SODS_EIRQ(13)] = LL_SYSCFG_EXTI_LINE13,
                        [SODS_EIRQ(14)] = LL_SYSCFG_EXTI_LINE14,
                        [SODS_EIRQ(15)] = LL_SYSCFG_EXTI_LINE15,
                },
        },
        .dma = {
                .ch2dma_map = {
                        [SODS_DMA_CH(0)] = DMA1,
                        [SODS_DMA_CH(1)] = DMA1,
                        [SODS_DMA_CH(2)] = DMA1,
                        [SODS_DMA_CH(3)] = DMA1,
                        [SODS_DMA_CH(4)] = DMA1,
                        [SODS_DMA_CH(5)] = DMA1,
                        [SODS_DMA_CH(6)] = DMA1,
                        [SODS_DMA_CH(7)] = DMA1,
                        [SODS_DMA_CH(8)] = DMA2,
                        [SODS_DMA_CH(9)] = DMA2,
                        [SODS_DMA_CH(10)] = DMA2,
                        [SODS_DMA_CH(11)] = DMA2,
                        [SODS_DMA_CH(12)] = DMA2,
                        [SODS_DMA_CH(13)] = DMA2,
                        [SODS_DMA_CH(14)] = DMA2,
                        [SODS_DMA_CH(15)] = DMA2,
                },
                .ch2stream_map = {
                        [SODS_DMA_CH(0)] = LL_DMA_STREAM_0,
                        [SODS_DMA_CH(1)] = LL_DMA_STREAM_1,
                        [SODS_DMA_CH(2)] = LL_DMA_STREAM_2,
                        [SODS_DMA_CH(3)] = LL_DMA_STREAM_3,
                        [SODS_DMA_CH(4)] = LL_DMA_STREAM_4,
                        [SODS_DMA_CH(5)] = LL_DMA_STREAM_5,
                        [SODS_DMA_CH(6)] = LL_DMA_STREAM_6,
                        [SODS_DMA_CH(7)] = LL_DMA_STREAM_7,
                        [SODS_DMA_CH(8)] = LL_DMA_STREAM_0,
                        [SODS_DMA_CH(9)] = LL_DMA_STREAM_1,
                        [SODS_DMA_CH(10)] = LL_DMA_STREAM_2,
                        [SODS_DMA_CH(11)] = LL_DMA_STREAM_3,
                        [SODS_DMA_CH(12)] = LL_DMA_STREAM_4,
                        [SODS_DMA_CH(13)] = LL_DMA_STREAM_5,
                        [SODS_DMA_CH(14)] = LL_DMA_STREAM_6,
                        [SODS_DMA_CH(15)] = LL_DMA_STREAM_7,
                },
        },
};

__atomic xwsq_t stm32cube_gpio_pin_state[] = {
        [SODS_GPIO_PORT_A] = 0,
        [SODS_GPIO_PORT_B] = 0,
        [SODS_GPIO_PORT_C] = 0,
        [SODS_GPIO_PORT_D] = 0,
        [SODS_GPIO_PORT_E] = 0,
        [SODS_GPIO_PORT_F] = 0,
        [SODS_GPIO_PORT_G] = 0,
        [SODS_GPIO_PORT_H] = 0,
        [SODS_GPIO_PORT_I] = 0,
        [SODS_GPIO_PORT_J] = 0,
        [SODS_GPIO_PORT_K] = 0,
};

__xwds_soc_eirq_tbl_qualifier xwds_eirq_f stm32cube_eirq_isr[] = {
        [SODS_EIRQ(0)] = NULL,
        [SODS_EIRQ(1)] = NULL,
        [SODS_EIRQ(2)] = NULL,
        [SODS_EIRQ(3)] = NULL,
        [SODS_EIRQ(4)] = NULL,
        [SODS_EIRQ(5)] = NULL,
        [SODS_EIRQ(6)] = NULL,
        [SODS_EIRQ(7)] = NULL,
        [SODS_EIRQ(8)] = NULL,
        [SODS_EIRQ(9)] = NULL,
        [SODS_EIRQ(10)] = NULL,
        [SODS_EIRQ(11)] = NULL,
        [SODS_EIRQ(12)] = NULL,
        [SODS_EIRQ(13)] = NULL,
        [SODS_EIRQ(14)] = NULL,
        [SODS_EIRQ(15)] = NULL,
        [SODS_EIRQ(16)] = NULL,
        [SODS_EIRQ(17)] = NULL,
        [SODS_EIRQ(18)] = NULL,
        [SODS_EIRQ(19)] = NULL,
        [SODS_EIRQ(20)] = NULL,
        [SODS_EIRQ(21)] = NULL,
        [SODS_EIRQ(22)] = NULL,
};

__xwds_soc_eirq_tbl_qualifier xwds_eirq_arg_t stm32cube_eirq_israrg[] = {
        [SODS_EIRQ(0)] = NULL,
        [SODS_EIRQ(1)] = NULL,
        [SODS_EIRQ(2)] = NULL,
        [SODS_EIRQ(3)] = NULL,
        [SODS_EIRQ(4)] = NULL,
        [SODS_EIRQ(5)] = NULL,
        [SODS_EIRQ(6)] = NULL,
        [SODS_EIRQ(7)] = NULL,
        [SODS_EIRQ(8)] = NULL,
        [SODS_EIRQ(9)] = NULL,
        [SODS_EIRQ(10)] = NULL,
        [SODS_EIRQ(11)] = NULL,
        [SODS_EIRQ(12)] = NULL,
        [SODS_EIRQ(13)] = NULL,
        [SODS_EIRQ(14)] = NULL,
        [SODS_EIRQ(15)] = NULL,
        [SODS_EIRQ(16)] = NULL,
        [SODS_EIRQ(17)] = NULL,
        [SODS_EIRQ(18)] = NULL,
        [SODS_EIRQ(19)] = NULL,
        [SODS_EIRQ(20)] = NULL,
        [SODS_EIRQ(21)] = NULL,
        [SODS_EIRQ(22)] = NULL,
};

__atomic xwbmpop_declare(stm32cube_dma_channel_state_map, 16) = {0,};

__xwds_soc_dma_tbl_qualifier
xwds_dma_f stm32cube_dma_cbcb_array[16] = {
        [SODS_DMA_CH(0)] = NULL,
        [SODS_DMA_CH(1)] = NULL,
        [SODS_DMA_CH(2)] = NULL,
        [SODS_DMA_CH(3)] = NULL,
        [SODS_DMA_CH(4)] = NULL,
        [SODS_DMA_CH(5)] = NULL,
        [SODS_DMA_CH(6)] = NULL,
        [SODS_DMA_CH(7)] = NULL,
        [SODS_DMA_CH(8)] = NULL,
        [SODS_DMA_CH(9)] = NULL,
        [SODS_DMA_CH(10)] = NULL,
        [SODS_DMA_CH(11)] = NULL,
        [SODS_DMA_CH(12)] = NULL,
        [SODS_DMA_CH(13)] = NULL,
        [SODS_DMA_CH(14)] = NULL,
        [SODS_DMA_CH(15)] = NULL,
};

__xwds_soc_dma_tbl_qualifier
xwds_dma_cbarg_t stm32cube_dma_chcbarg_array[16] = {
        [SODS_DMA_CH(0)] = NULL,
        [SODS_DMA_CH(1)] = NULL,
        [SODS_DMA_CH(2)] = NULL,
        [SODS_DMA_CH(3)] = NULL,
        [SODS_DMA_CH(4)] = NULL,
        [SODS_DMA_CH(5)] = NULL,
        [SODS_DMA_CH(6)] = NULL,
        [SODS_DMA_CH(7)] = NULL,
        [SODS_DMA_CH(8)] = NULL,
        [SODS_DMA_CH(9)] = NULL,
        [SODS_DMA_CH(10)] = NULL,
        [SODS_DMA_CH(11)] = NULL,
        [SODS_DMA_CH(12)] = NULL,
        [SODS_DMA_CH(13)] = NULL,
        [SODS_DMA_CH(14)] = NULL,
        [SODS_DMA_CH(15)] = NULL,
};

