xwos/XWOS/xwbd/stm32f42xdkp/bm/stm32cube/xwds/soc.c
#if defined(XWMDCFG_ds_SOC_DMA) && (1 == XWMDCFG_ds_SOC_DMA)
/******** ******** DMA driver ******** ********/
static
xwer_t stm32cube_soc_drv_dma_req(struct xwds_soc * soc, xwid_t ch)
{
        return OK;
}

static
xwer_t stm32cube_soc_drv_dma_rls(struct xwds_soc * soc, xwid_t ch)
{
        return OK;
}

static
xwer_t stm32cube_soc_drv_dma_cfg(struct xwds_soc * soc, xwid_t ch, void * cfg)
{
        const struct stm32cube_soc_cfg * xwccfg;
        LL_DMA_InitTypeDef * cubecfg;
        DMA_TypeDef * dma;
        uint32_t stream;
        uint32_t cuberc;
        xwer_t rc;

        xwccfg = soc->xwccfg;
        dma = xwccfg->dma.ch2dma_map[ch];
        stream = xwccfg->dma.ch2stream_map[ch];
        cubecfg = cfg;
        if (LL_DMA_IsEnabledStream(dma, stream)) {
                rc = -EPERM;
        } else {
                if (cubecfg) {
                        cuberc = LL_DMA_Init(dma, stream, cubecfg);
                        if (SUCCESS == cuberc) {
                                rc = OK;
                        } else {
                                rc = -EINVAL;
                        }
                } else {
                        rc = OK;
                }
        }
        return rc;
}

static
xwer_t stm32cube_soc_drv_dma_enable(struct xwds_soc * soc, xwid_t ch)
{
        const struct stm32cube_soc_cfg * xwccfg;
        DMA_TypeDef * dma;
        uint32_t stream;
        xwer_t rc;

        xwccfg = soc->xwccfg;
        dma = xwccfg->dma.ch2dma_map[ch];
        stream = xwccfg->dma.ch2stream_map[ch];
        if (LL_DMA_IsEnabledStream(dma, stream)) {
                rc = -EALREADY;
        } else {
                switch (stream) {
                case LL_DMA_STREAM_0:
                        LL_DMA_ClearFlag_HT0(dma);
                        LL_DMA_ClearFlag_TC0(dma);
                        LL_DMA_ClearFlag_TE0(dma);
                        LL_DMA_ClearFlag_DME0(dma);
                        LL_DMA_ClearFlag_FE0(dma);
                        break;
                case LL_DMA_STREAM_1:
                        LL_DMA_ClearFlag_HT1(dma);
                        LL_DMA_ClearFlag_TC1(dma);
                        LL_DMA_ClearFlag_TE1(dma);
                        LL_DMA_ClearFlag_DME1(dma);
                        LL_DMA_ClearFlag_FE1(dma);
                        break;
                case LL_DMA_STREAM_2:
                        LL_DMA_ClearFlag_HT2(dma);
                        LL_DMA_ClearFlag_TC2(dma);
                        LL_DMA_ClearFlag_TE2(dma);
                        LL_DMA_ClearFlag_DME2(dma);
                        LL_DMA_ClearFlag_FE2(dma);
                        break;
                case LL_DMA_STREAM_3:
                        LL_DMA_ClearFlag_HT3(dma);
                        LL_DMA_ClearFlag_TC3(dma);
                        LL_DMA_ClearFlag_TE3(dma);
                        LL_DMA_ClearFlag_DME3(dma);
                        LL_DMA_ClearFlag_FE3(dma);
                        break;
                case LL_DMA_STREAM_4:
                        LL_DMA_ClearFlag_HT4(dma);
                        LL_DMA_ClearFlag_TC4(dma);
                        LL_DMA_ClearFlag_TE4(dma);
                        LL_DMA_ClearFlag_DME4(dma);
                        LL_DMA_ClearFlag_FE4(dma);
                        break;
                case LL_DMA_STREAM_5:
                        LL_DMA_ClearFlag_HT5(dma);
                        LL_DMA_ClearFlag_TC5(dma);
                        LL_DMA_ClearFlag_TE5(dma);
                        LL_DMA_ClearFlag_DME5(dma);
                        LL_DMA_ClearFlag_FE5(dma);
                        break;
                case LL_DMA_STREAM_6:
                        LL_DMA_ClearFlag_HT6(dma);
                        LL_DMA_ClearFlag_TC6(dma);
                        LL_DMA_ClearFlag_TE6(dma);
                        LL_DMA_ClearFlag_DME6(dma);
                        LL_DMA_ClearFlag_FE6(dma);
                        break;
                case LL_DMA_STREAM_7:
                        LL_DMA_ClearFlag_HT7(dma);
                        LL_DMA_ClearFlag_TC7(dma);
                        LL_DMA_ClearFlag_TE7(dma);
                        LL_DMA_ClearFlag_DME7(dma);
                        LL_DMA_ClearFlag_FE7(dma);
                        break;
                }
                LL_DMA_EnableStream(dma, stream);
                rc = OK;
        }
        return rc;
}

static
xwer_t stm32cube_soc_drv_dma_disable(struct xwds_soc * soc, xwid_t ch)
{
        const struct stm32cube_soc_cfg * xwccfg;
        DMA_TypeDef * dma;
        uint32_t stream;
        xwer_t rc;

        xwccfg = soc->xwccfg;
        dma = xwccfg->dma.ch2dma_map[ch];
        stream = xwccfg->dma.ch2stream_map[ch];
        if (LL_DMA_IsEnabledStream(dma, stream)) {
                LL_DMA_DisableStream(dma, stream);
                rc = OK;
        } else {
                rc = -EALREADY;
        }

        switch (stream) {
        case LL_DMA_STREAM_0:
                LL_DMA_ClearFlag_HT0(dma);
                LL_DMA_ClearFlag_TC0(dma);
                LL_DMA_ClearFlag_TE0(dma);
                LL_DMA_ClearFlag_DME0(dma);
                LL_DMA_ClearFlag_FE0(dma);
                break;
        case LL_DMA_STREAM_1:
                LL_DMA_ClearFlag_HT1(dma);
                LL_DMA_ClearFlag_TC1(dma);
                LL_DMA_ClearFlag_TE1(dma);
                LL_DMA_ClearFlag_DME1(dma);
                LL_DMA_ClearFlag_FE1(dma);
                break;
        case LL_DMA_STREAM_2:
                LL_DMA_ClearFlag_HT2(dma);
                LL_DMA_ClearFlag_TC2(dma);
                LL_DMA_ClearFlag_TE2(dma);
                LL_DMA_ClearFlag_DME2(dma);
                LL_DMA_ClearFlag_FE2(dma);
                break;
        case LL_DMA_STREAM_3:
                LL_DMA_ClearFlag_HT3(dma);
                LL_DMA_ClearFlag_TC3(dma);
                LL_DMA_ClearFlag_TE3(dma);
                LL_DMA_ClearFlag_DME3(dma);
                LL_DMA_ClearFlag_FE3(dma);
                break;
        case LL_DMA_STREAM_4:
                LL_DMA_ClearFlag_HT4(dma);
                LL_DMA_ClearFlag_TC4(dma);
                LL_DMA_ClearFlag_TE4(dma);
                LL_DMA_ClearFlag_DME4(dma);
                LL_DMA_ClearFlag_FE4(dma);
                break;
        case LL_DMA_STREAM_5:
                LL_DMA_ClearFlag_HT5(dma);
                LL_DMA_ClearFlag_TC5(dma);
                LL_DMA_ClearFlag_TE5(dma);
                LL_DMA_ClearFlag_DME5(dma);
                LL_DMA_ClearFlag_FE5(dma);
                break;
        case LL_DMA_STREAM_6:
                LL_DMA_ClearFlag_HT6(dma);
                LL_DMA_ClearFlag_TC6(dma);
                LL_DMA_ClearFlag_TE6(dma);
                LL_DMA_ClearFlag_DME6(dma);
                LL_DMA_ClearFlag_FE6(dma);
                break;
        case LL_DMA_STREAM_7:
                LL_DMA_ClearFlag_HT7(dma);
                LL_DMA_ClearFlag_TC7(dma);
                LL_DMA_ClearFlag_TE7(dma);
                LL_DMA_ClearFlag_DME7(dma);
                LL_DMA_ClearFlag_FE7(dma);
                break;
        }
        return rc;
}

